andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_mdk_fixups.h
#ifndef NRFX_MDK_FIXUPS_H__
#define NRFX_MDK_FIXUPS_H__

/**************************************************************************************************/
/* Start fixups section for NRF51                                                                 */
/**************************************************************************************************/

#if defined(NRF51)
    #define NVMC_FLASH_BASE_ADDRESS 0

    #define ECB_TASKS_STARTECB_TASKS_STARTECB_Msk
    #define ECB_TASKS_STOPECB_TASKS_STOPECB_Msk
    #define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Msk
    #define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Msk
    #define ECB_ECBDATAPTR_ECBDATAPTR_Msk

    #define EVENT_READBACK_NOT_NEEDED 1

    #define FICR_CODEPAGESIZE_CODEPAGESIZE_Msk
    #define FICR_CODESIZE_CODESIZE_Msk
    #define FICR_DEVICEID_DEVICEID_Msk
    #define FICR_DEVICEADDR_DEVICEADDR_Msk
    #define FICR_ER_ER_Msk
    #define FICR_IR_IR_Msk

    #define UICR_CLENR0_CLENR0_Msk

    #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk
    #define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk

    #define QDEC_LEDPRE_ResetValue 0x10

    #define WDT_RR_MaxCount 8
    #define CCM_TASKS_KSGEN_TASKS_KSGEN_Msk
    #define CCM_TASKS_CRYPT_TASKS_CRYPT_Msk

    #define AAR_IRKPTR_IRKPTR_Msk
    #define AAR_ADDRPTR_ADDRPTR_Msk
    #define AAR_SCRATCHPTR_SCRATCHPTR_Msk

    #define DELAY_CUSTOM_CYCLES 4
    #define DWT_MISSING
#endif

/**************************************************************************************************/
/* End fixups section for NRF51                                                                   */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF52_SERIES                                                          */
/**************************************************************************************************/
#if defined(NRF52_SERIES)
    #define QDEC_LEDPRE_ResetValue           0x10
    #define QSPI_BASE_CLOCK_FREQ             32000000uL
    #define SPIM_PSEL_DCX_ResetValue         0xFFFFFFFFUL
    #define SPIM_PSEL_CSN_ResetValue         0xFFFFFFFFUL
    #define SPIM_IFTIMING_CSNDUR_ResetValue  0x2UL
    #define SPIM_CSNPOL_ResetValue           0x0UL
    #define SPIM_IFTIMING_RXDELAY_ResetValue 0x2UL
    #define WDT_RR_MaxCount 8
    #define SAADC_SAMPLERATE_CC_Min          80UL
    #define SAADC_SAMPLERATE_CC_Max          2047UL
    #define NFCT_FRAMEDELAYMIN_ResetValue    0x480UL
    #define NFCT_FRAMEDELAYMAX_ResetValue    0x1000UL
    #define NVMC_FLASH_BASE_ADDRESS          0
    #if defined(NRF52805_XXAA) || defined(NRF52810_XXAA) || \
        defined(NRF52811_XXAA) || defined(NRF52840_XXAA)
        #define NVMC_PAGE_ERASE_DURATION_MS  85
    #elif defined(NRF52820_XXAA) || defined(NRF52833_XXAA)
        #define NVMC_PAGE_ERASE_DURATION_MS  87
    #endif
    #if defined(NRF52810_XXAA) || defined(NRF52811_XXAA) || \
        defined(NRF52832_XXAA) || defined(NRF52834_XXAA)
        #define PDM_RATIO_VALUE 64
    #endif
    #if defined(NRF52805_XXAA) || defined(NRF52810_XXAA) || \
        defined(NRF52811_XXAA) || defined(NRF52820_XXAA)
        #define DELAY_CUSTOM_CYCLES 7
        #define DWT_MISSING
    #endif
#endif
/**************************************************************************************************/
/* End fixups section for NRF52_SERIES                                                            */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF52820_XXAA                                                         */
/**************************************************************************************************/
#if defined(NRF52820_XXAA)
    #if defined(DEVELOP_IN_NRF52833)
    /* Allow use of the following additional GPIOs that are connected to LEDs and buttons
    * on the nRF52833 DK:
    * - P0.11 - Button 1
    * - P0.12 - Button 2
    * - P0.13 - LED 1
    * - P0.24 - Button 3
    * - P0.25 - Button 4
    */
        #define GPIO_PINS_OVERRIDE 0x03003800
    #endif
    #define GPIOTE_SPARSE_PINS
#endif
/**************************************************************************************************/
/* End fixups section for NRF52820_XXAA                                                           */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF53_SERIES                                                          */
/**************************************************************************************************/
#if defined(NRF53_SERIES)
    #define POWER_GPREGRET_MaxCount 2
    #define QDEC_LEDPRE_ResetValue 0x10
    #define QSPI_BASE_CLOCK_FREQ    96000000uL
    #define SPIM_PSEL_DCX_ResetValue         0xFFFFFFFFUL
    #define SPIM_PSEL_CSN_ResetValue         0xFFFFFFFFUL
    #define SPIM_IFTIMING_CSNDUR_ResetValue  0x2UL
    #define SPIM_CSNPOL_ResetValue           0x0UL
    #define SPIM_IFTIMING_RXDELAY_ResetValue 0x2UL
    #define SPIM_DCX_DISCONNECTED_READBACK   0x11F
    #if defined(NRF_APPLICATION)
        #define VMC_RAM_SECTION_COUNT   16
        #define NVMC_FLASH_BASE_ADDRESS 0
        #define NVMC_FLASH_PAGE_COUNT   256
        #define NVMC_FLASH_PAGE_SIZE    0x1000 ///< 4 kB
        #if defined(NRF_TRUSTZONE_NONSECURE)
            #define GPIOTE_ASSERT_INSTANCE  NRF_GPIOTE1
        #else
            #define GPIOTE_ASSERT_INSTANCE  NRF_GPIOTE0
        #endif
    #else
        #define VMC_RAM_SECTION_COUNT   4
        #define NVMC_FLASH_BASE_ADDRESS 0x01000000UL
        #define NVMC_FLASH_PAGE_COUNT   128
        #define NVMC_FLASH_PAGE_SIZE    0x800  ///< 2 kB
        #undef CLOCK_INTENSET_HFCLK192MSTARTED_Msk
        #undef CLOCK_INTENSET_HFCLKAUDIOSTARTED_Msk
        #undef CLOCK_HFCLKCTRL_HCLK_Div1
    #endif
    #define WDT_RR_MaxCount 8
    #define SAADC_SAMPLERATE_CC_Min          80UL
    #define SAADC_SAMPLERATE_CC_Max          2047UL
    #define NFCT_FRAMEDELAYMIN_ResetValue    0x480UL
    #define NFCT_FRAMEDELAYMAX_ResetValue    0x1000UL
    #define NVMC_PAGE_ERASE_DURATION_MS      87
    #define TWIM_1MBPS_NEEDS_E0E1

    #define QSPI_IO0_DEDICATED NRF_GPIO_PIN_MAP(0, 13)
    #define QSPI_IO1_DEDICATED NRF_GPIO_PIN_MAP(0, 14)
    #define QSPI_IO2_DEDICATED NRF_GPIO_PIN_MAP(0, 15)
    #define QSPI_IO3_DEDICATED NRF_GPIO_PIN_MAP(0, 16)
    #define QSPI_SCK_DEDICATED NRF_GPIO_PIN_MAP(0, 17)
    #define QSPI_CSN_DEDICATED NRF_GPIO_PIN_MAP(0, 18)

    #if defined(NRF_APPLICATION)
        #define SPIM_SCK_DEDICATED  NRF_GPIO_PIN_MAP(0, 8)
        #define SPIM_MOSI_DEDICATED NRF_GPIO_PIN_MAP(0, 9)
        #define SPIM_MISO_DEDICATED NRF_GPIO_PIN_MAP(0, 10)
        #define SPIM_CSN_DEDICATED  NRF_GPIO_PIN_MAP(0, 11)
        #define SPIM_DCX_DEDICATED  NRF_GPIO_PIN_MAP(0, 12)
    #endif

