andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_mdk_fixups.h
    #define DPPI_TYPE_NORMAL

    #define PDM_PDMCLKCTRL_FACTOR 4096
    #define PDM_FREQ_FACTOR       1048576ULL

    #define DOMAIN_NET

    #define I2S_MCKFREQ_FACTOR 1048576
#endif
/**************************************************************************************************/
/* End fixups section for NRF53_SERIES                                                            */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF91_SERIES                                                          */
/**************************************************************************************************/
#if defined(NRF91_SERIES)
    #define POWER_GPREGRET_MaxCount          2L
    #define SPIM_PSEL_DCX_ResetValue         0xFFFFFFFFUL
    #define SPIM_PSEL_CSN_ResetValue         0xFFFFFFFFUL
    #define SPIM_IFTIMING_CSNDUR_ResetValue  0x2UL
    #define SPIM_CSNPOL_ResetValue           0x0UL
    #define SPIM_IFTIMING_RXDELAY_ResetValue 0x2UL
    #define VMC_RAM_SECTION_COUNT            4
    #define VMC_FEATURE_RAM_REGISTERS_COUNT  4
    #define WDT_RR_MaxCount 8
    #define SAADC_SAMPLERATE_CC_Min          80UL
    #define SAADC_SAMPLERATE_CC_Max          2047UL
    #define NVMC_FLASH_BASE_ADDRESS          0
    #define NVMC_FLASH_PAGE_COUNT            256
    #define NVMC_FLASH_PAGE_SIZE             0x1000 ///< 4 kB
    #define NVMC_PAGE_ERASE_DURATION_MS      87
    #if defined(NRF_TRUSTZONE_NONSECURE)
        #define GPIOTE_ASSERT_INSTANCE  NRF_GPIOTE1
    #else
        #define GPIOTE_ASSERT_INSTANCE  NRF_GPIOTE0
    #endif

    #define DPPI_TYPE_NORMAL

    #define DOMAIN_MODEM
#endif
/**************************************************************************************************/
/* End fixups section for NRF91_SERIES                                                            */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for HALTIUM_XXAA                                                          */
/**************************************************************************************************/

#if defined(HALTIUM_XXAA)
    #include "mdk/haltium_interim.h"

    #define EASYVDMA_PRESENT

    typedef struct {
        __IOM uint32_t  STMSTIMR[32];
        __IM  uint32_t  RESERVED0[737];
        __OM  uint32_t  STMDMASTARTR;
        __OM  uint32_t  STMDMASTOPR;
        __IM  uint32_t  STMDMASTATR;
        __IOM uint32_t  STMDMACTLR;
        __IM  uint32_t  RESERVED1[58];
        __IM  uint32_t  STMDMAIDR;
        __IOM uint32_t  STMHEER;
        __IM  uint32_t  RESERVED2[7];
        __IOM uint32_t  STMHETER;
        __IM  uint32_t  RESERVED3[16];
        __IOM uint32_t  STMHEMCR;
        __IM  uint32_t  RESERVED4[35];
        __IM  uint32_t  STMHEMASTR;
        __IM  uint32_t  STMHEFEAT1R;
        __IM  uint32_t  STMHEIDR;
        __IOM uint32_t  STMSPER;
        __IM  uint32_t  RESERVED5[7];
        __IOM uint32_t  STMSPTER;
        __IM  uint32_t  RESERVED6[15];
        __IOM uint32_t  STMSPSCR;
        __IOM uint32_t  STMSPMSCR;
        __IOM uint32_t  STMSPOVERRIDER;
        __IOM uint32_t  STMSPMOVERRIDER;
        __IOM uint32_t  STMSPTRIGCSR;
        __IM  uint32_t  RESERVED7[3];
        __IOM uint32_t  STMTCSR;
        __OM  uint32_t  STMTSSTIMR;
        __IM  uint32_t  RESERVED8;
        __IOM uint32_t  STMTSFREQR;
        __IOM uint32_t  STMSYNCR;
        __IOM uint32_t  STMAUXCR;
        __IM  uint32_t  RESERVED9[2];
        __IOM uint32_t  STMSPFEAT1R;
        __IOM uint32_t  STMSPFEAT2R;
        __IOM uint32_t  STMSPFEAT3R;
        __IM  uint32_t  RESERVED10[15];
        __OM  uint32_t  STMITTRIGGER;
        __OM  uint32_t  STMITATBDATA0;
        __OM  uint32_t  STMITATBCTR2;
        __OM  uint32_t  STMITATBID;
        __OM  uint32_t  STMITATBCTR0;
        __IM  uint32_t  RESERVED11;
        __IOM uint32_t  ITCTRL;
        __IM  uint32_t  RESERVED12[43];
        __IOM uint32_t  LAR;
        __IOM uint32_t  LSR;
        __IOM uint32_t  AUTHSTATUS;
        __IM  uint32_t  RESERVED13[3];
        __IM  uint32_t  DEVID;
        __IM  uint32_t  DEVTYPE;
        __IOM uint32_t  PIDR4;
        __IM  uint32_t  RESERVED14[3];
        __IOM uint32_t  PIDR0;
        __IOM uint32_t  PIDR1;
        __IOM uint32_t  PIDR2;
        __IOM uint32_t  PIDR3;
        __IOM uint32_t  CIDR0;
        __IOM uint32_t  CIDR1;
        __IOM uint32_t  CIDR2;
        __IOM uint32_t  CIDR3;
    } NRF_STM_Type_fixed;

    #if defined(NRF_STM_NS)
        #undef NRF_STM_NS
        #define NRF_STM_NS ((NRF_STM_Type_fixed*) NRF_STM_NS_BASE)
    #endif

    #define NRF_STM_Type NRF_STM_Type_fixed

    #if defined(NRF_ETB_NS)
        #undef NRF_ETB_NS
        #define NRF_ETB_NS ((NRF_TMC_Type*) NRF_ETB_NS_BASE)
    #endif

    typedef struct {
        __OM  uint32_t G_DMTS[2];
        __OM  uint32_t G_DM[2];
        __OM  uint32_t G_DTS[2];
        __OM  uint32_t G_D[2];
        __IM  uint32_t RESERVED0[16];
        __OM  uint32_t G_FLAGTS[2];
        __OM  uint32_t G_FLAG[2];
        __OM  uint32_t G_TRIGTS[2];
        __OM  uint32_t G_TRIG[2];
        __OM  uint32_t I_DMTS[2];
        __OM  uint32_t I_DM[2];
        __OM  uint32_t I_DTS[2];
        __OM  uint32_t I_D[2];
        __IM  uint32_t RESERVED1[16];
        __OM  uint32_t I_FLAGTS[2];
        __OM  uint32_t I_FLAG[2];
        __OM  uint32_t I_TRIGTS[2];
        __OM  uint32_t I_TRIG[2];
    } NRF_STMESP_Type;

    #define NRF_APPLICATION_STMESP_NS_BASE 0xA2000000UL
    #define NRF_APPLICATION_STMESP_NS      ((NRF_STMESP_Type*) NRF_APPLICATION_STMESP_NS_BASE)
    #define NRF_APPLICATION_STMESP         NRF_APPLICATION_STMESP_NS

    #define NRF_RADIOCORE_STMESP_NS_BASE 0xA3000000UL
    #define NRF_RADIOCORE_STMESP_NS      ((NRF_STMESP_Type*) NRF_RADIOCORE_STMESP_NS_BASE)
    #define NRF_RADIOCORE_STMESP         NRF_RADIOCORE_STMESP_NS

    #if defined(NRF_APPLICATION)
        #define NRF_STMESP NRF_APPLICATION_STMESP
    #endif

    #if defined(NRF_RADIOCORE)
        #define NRF_STMESP NRF_RADIOCORE_STMESP
    #endif

    #define DMA_BUFFER_UNIFIED_BYTE_ACCESS 1

    #define TYPES_DOMAIN
    #define TYPES_PROCESSOR
    #define TYPES_OWNER

    #define DMA_ACCESSIBLE_CUSTOM_CHECK 1

    #if defined(NRF_APPLICATION) || defined(NRF_PPR) || defined(NRF_FLPR)
        #define GPIOTE_PORT_ID 1
    #elif defined(NRF_RADIOCORE)
        #define GPIOTE_PORT_ID 2
    #endif

