andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_mdk_fixups.h
    #if (!defined(__VPR_REV) && defined(NRF_TRUSTZONE_NONSECURE)) || defined(__VPR_REV)
        #define GPIOTE130_IRQn       GPIOTE130_0_IRQn
        #define GPIOTE130_IRQHandler GPIOTE130_0_IRQHandler
    #else
        #define GPIOTE130_IRQn       GPIOTE130_1_IRQn
        #define GPIOTE130_IRQHandler GPIOTE130_1_IRQHandler
    #endif

    #if defined(__VPR_REV)
        #define GPIOTE_SECURE_SUFFIX_OVERRIDE NONSECURE
    #endif

    #if (!defined(__VPR_REV) && defined(NRF_TRUSTZONE_NONSECURE)) || defined(__VPR_REV)
        #define GRTC_IRQn       GRTC_0_IRQn
        #define GRTC_IRQHandler GRTC_0_IRQHandler
    #else
        #define GRTC_IRQn       GRTC_1_IRQn
        #define GRTC_IRQHandler GRTC_1_IRQHandler
    #endif

    #define GRTC_MAIN_CC_CHANNEL 1

    #define I2S_CLOCKPIN_SCK_NEEDED
    #define I2S_CLOCKPIN_LRCK_NEEDED
    #define I2S_CLOCKPIN_MCK_NEEDED

    #define SPIM_CLOCKPIN_MOSI_NEEDED
    #define SPIM_CLOCKPIN_SCK_NEEDED

    #define SPIS_CLOCKPIN_MISO_NEEDED
    #define SPIS_CLOCKPIN_SCK_NEEDED

    #define TDM_CLOCKPIN_SCK_NEEDED
    #define TDM_CLOCKPIN_FSYNC_NEEDED
    #define TDM_CLOCKPIN_MCK_NEEDED

    #define EXMIF_MAX_MEMORY_DEVICE_SIZE 0x10000000UL
    #define EXMIF_MAX_NUMBER_OF_DEVICES  2

    #define TWIM_CLOCKPIN_SCL_NEEDED
    #define TWIS_CLOCKPIN_SCL_NEEDED
    #define UARTE_CLOCKPIN_TXD_NEEDED

    #define SPIM_CHECK_DISABLE_ON_XFER_END

    #define DPPI_TYPE_IPCT

    #define DOMAIN_FLPR
#endif

/**************************************************************************************************/
/* End fixups section for HALTIUM_XXAA                                                            */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for LUMOS_XXAA                                                            */
/**************************************************************************************************/

#if defined(LUMOS_XXAA)
    #define DMA_BUFFER_UNIFIED_BYTE_ACCESS 1

    #if (defined(NRF_APPLICATION) && defined(NRF_TRUSTZONE_NONSECURE)) || \
        defined(NRF_FLPR) || defined(NRF54LS05B_ENGA_XXAA)
        #define GPIOTE20_IRQn       GPIOTE20_0_IRQn
        #define GPIOTE20_IRQHandler GPIOTE20_0_IRQHandler
        #define GPIOTE30_IRQn       GPIOTE30_0_IRQn
        #define GPIOTE30_IRQHandler GPIOTE30_0_IRQHandler
    #else
        #define GPIOTE20_IRQn       GPIOTE20_1_IRQn
        #define GPIOTE20_IRQHandler GPIOTE20_1_IRQHandler
        #define GPIOTE30_IRQn       GPIOTE30_1_IRQn
        #define GPIOTE30_IRQHandler GPIOTE30_1_IRQHandler
    #endif

    #define GPIOTE_PORT_ID 0

    #if defined(NRF_TRUSTZONE_NONSECURE)
    /* Non-secure images must have CPU frequency specified and cannot rely on default values,
     * as NRF_OSCILLATORS might be assigned and configured by Secure image. */
        #if defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 64)
            #define NRF_CPU_FREQ_IS_64MHZ 1
        #elif defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 128)
            #define NRF_CPU_FREQ_IS_128MHZ 1
        #elif defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 256)
            #define NRF_CPU_FREQ_IS_256MHZ 1
        #elif !defined(NRF_CONFIG_CPU_FREQ_MHZ)
            #error "MCU frequency not specified"
        #else
            #error "Invalid MCU frequency"
        #endif
    #else
        #if defined(NRF_SKIP_CLOCK_CONFIGURATION) || \
            (defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 64))
            #define NRF_CPU_FREQ_IS_64MHZ 1
        #elif defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 128)
            #define NRF_CPU_FREQ_IS_128MHZ 1
        #elif !defined(NRF_CONFIG_CPU_FREQ_MHZ)
            /* If clock configuration is not skipped and frequency not specified,
            * SystemInit() applies 128 MHz setting. */
            #define NRF_CPU_FREQ_IS_128MHZ 1
        #elif defined(NRF_CONFIG_CPU_FREQ_MHZ) && (NRF_CONFIG_CPU_FREQ_MHZ == 256)
            #define NRF_CPU_FREQ_IS_256MHZ 1
        #else
            #error "Invalid MCU frequency"
        #endif
    #endif

    #define TYPES_DOMAIN
    #define TYPES_OWNER

    #define GRTC_FORCE_EXTENDED
    #if defined(NRF_FLPR) || defined(NRF54LS05B_ENGA_XXAA)
        #define GRTC_IRQn       GRTC_0_IRQn
        #define GRTC_IRQHandler GRTC_0_IRQHandler
    #elif defined(NRF_APPLICATION) && defined(NRF_TRUSTZONE_NONSECURE)
        #define GRTC_IRQn       GRTC_1_IRQn
        #define GRTC_IRQHandler GRTC_1_IRQHandler
    #elif defined(NRF_APPLICATION) && !defined(NRF_TRUSTZONE_NONSECURE)
        #define GRTC_IRQn       GRTC_2_IRQn
        #define GRTC_IRQHandler GRTC_2_IRQHandler
    #endif

    #if defined(NRF_FLPR)
        #define GRTC_MAIN_CC_CHANNEL 4
    #else
        #define GRTC_MAIN_CC_CHANNEL 0
    #endif

    #define SPIM_FORCE_H0H1

    #define DPPI_TYPE_PPIB

    #define DELAY_RISCV_SLOWDOWN 15
#endif

/**************************************************************************************************/
/* End fixups section for LUMOS_XXAA                                                              */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54H20_XXAA (LILIUM 1.1)                                            */
/**************************************************************************************************/

#if defined(NRF54H20_XXAA)
    #include "mdk/nrf54h20_interim.h"

    #define RESETHUB_HAS_NETWORK

    #define TWIM_CLOCKPIN_SDA_NEEDED
    #define TWIS_CLOCKPIN_SDA_NEEDED

    #define PDM_PDMCLKCTRL_FACTOR 8192
    #define PDM_FREQ_FACTOR       1048576ULL

    #define DWT_MISSING
#endif

/**************************************************************************************************/
/* End fixups section for NRF54H20_XXAA (LILIUM 1.1)                                              */
/**************************************************************************************************/

