andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_mdk_fixups.h
/**************************************************************************************************/
/* Start fixups section for NRF54L05_XXAA                                                         */
/**************************************************************************************************/

#if defined(NRF54L05_XXAA)
    #include "mdk/nrf54l05_interim.h"
    #define CLOCK_STATIC_IRQ
    #define TRNG_CLK_DIV 0
    #define I2S_MCKFREQ_FACTOR 1048576
#endif

/**************************************************************************************************/
/* End fixups section for NRF54L05_XXAA                                                           */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54L10_XXAA                                                         */
/**************************************************************************************************/

#if defined(NRF54L10_XXAA)
    #include "mdk/nrf54l10_interim.h"
    #define CLOCK_STATIC_IRQ
    #define TRNG_CLK_DIV 0
    #define I2S_MCKFREQ_FACTOR 1048576
#endif

/**************************************************************************************************/
/* End fixups section for NRF54L10_XXAA                                                           */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54L15_XXAA                                                         */
/**************************************************************************************************/

#if defined(NRF54L15_XXAA)
    #include "mdk/nrf54l15_interim.h"
    #define CLOCK_STATIC_IRQ
    #define TRNG_CLK_DIV 0
    #define I2S_MCKFREQ_FACTOR 1048576
#endif

/**************************************************************************************************/
/* End fixups section for NRF54L15_XXAA                                                           */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54LM20A_XXAA                                                       */
/**************************************************************************************************/

#if defined(NRF54LM20A_XXAA)
    #include "mdk/nrf54lm20a_interim.h"
    #define TRNG_CLK_DIV 1
    #define I2S_MCKFREQ_FACTOR 1048576
#endif

/**************************************************************************************************/
/* End fixups section for NRF54LM20A_XXAA                                                         */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54LS05B_ENGA_XXAA                                                  */
/**************************************************************************************************/

#if defined(NRF54LS05B_ENGA_XXAA)
    #include "mdk/nrf54ls05b_enga_interim.h"
    #define GPIOTE_SECURE_SUFFIX_OVERRIDE NONSECURE
    #define TRNG_CLK_DIV 1
#endif

/**************************************************************************************************/
/* End fixups section for NRF54LS05B_ENGA_XXAA                                                    */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF54LV10A_ENGA_XXAA                                                  */
/**************************************************************************************************/

#if defined(NRF54LV10A_ENGA_XXAA)
    #define TRNG_CLK_DIV 1
#endif

/**************************************************************************************************/
/* End fixups section for NRF54LV10A_ENGA_XXAA                                                    */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF7120_ENGA_XXAA                                                         */
/**************************************************************************************************/

#if defined(NRF7120_ENGA_XXAA)
    #include "mdk/nrf7120_enga_interim.h"

    #define ADDRESS_BUS_Pos (18UL)
    #define ADDRESS_BUS_Msk (0x3FUL << ADDRESS_BUS_Pos)
#endif

/**************************************************************************************************/
/* End fixups section for NRF7120_ENGA_XXAA                                                           */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for NRF9230_ENGB_XXAA (HSOC 1.1)                                          */
/**************************************************************************************************/

#if defined(NRF9230_ENGB_XXAA)
    #if defined(NRF_APPLICATION)
        #define NRF_DOMAIN NRF_DOMAIN_APPLICATION
    #elif defined(NRF_RADIOCORE)
        #define NRF_DOMAIN NRF_DOMAIN_RADIOCORE
    #elif defined(NRF_FLPR)
        #define NRF_DOMAIN NRF_DOMAIN_GLOBALFAST
    #elif defined(NRF_PPR)
        #define NRF_DOMAIN NRF_DOMAIN_GLOBALSLOW
    #endif

    #if defined(NRF_APPLICATION)
        #define NRF_PROCESSOR NRF_PROCESSOR_APPLICATION
    #elif defined(NRF_RADIOCORE)
        #define NRF_PROCESSOR NRF_PROCESSOR_RADIOCORE
    #elif defined(NRF_FLPR)
        #define NRF_PROCESSOR NRF_PROCESSOR_FLPR
    #elif defined(NRF_PPR)
        #define NRF_PROCESSOR NRF_PROCESSOR_PPR
    #endif

    #if defined(NRF_APPLICATION)
        #define NRF_OWNER NRF_OWNER_APPLICATION
    #elif defined(NRF_RADIOCORE)
        #define NRF_OWNER NRF_OWNER_RADIOCORE
    #elif defined(NRF_FLPR) && !defined(NRF_OWNER)
        #define NRF_OWNER NRF_OWNER_APPLICATION
    #elif defined(NRF_PPR) && !defined(NRF_OWNER)
        #define NRF_OWNER NRF_OWNER_APPLICATION
    #endif

    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Pos (2UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Pos)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Min (0x0UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Max (0x1UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Disabled (0x0UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Enabled (0x1UL)

