andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_mdk_fixups.h
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Pos (3UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Pos)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Min (0x0UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Max (0x1UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Disabled (0x0UL)
    #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Enabled (0x1UL)

    #include "mdk/nrf9230_engb_interim.h"

    // Old HFXO modes are not supported
    #ifdef BICR_HFXO_CONFIG_MODE_Pierce
        #undef BICR_HFXO_CONFIG_MODE_Pierce
    #endif
    #ifdef BICR_HFXO_CONFIG_MODE_PIXO
        #undef BICR_HFXO_CONFIG_MODE_PIXO
    #endif
    #ifdef BICR_HFXO_CONFIG_MODE_ExtSquare
        #undef BICR_HFXO_CONFIG_MODE_ExtSquare
    #endif
    #ifdef BICR_HFXO_CONFIG_MODE_Auto
        #undef BICR_HFXO_CONFIG_MODE_Auto
    #endif
    #define BICR_HFXO_CONFIG_MODE_Normal   (0x0UL)     /*!< HFXO Normal mode.                                                    */
    #define BICR_HFXO_CONFIG_MODE_TCXO     (0x1UL)     /*!< HFXO TCXO/bypass mode.                                               */
    #define BICR_HFXO_CONFIG_MODE_Crystal2 (0x2UL)     /*!< Reserved value.                                                      */
    #define BICR_HFXO_CONFIG_MODE_Crystal3 (0x3UL)     /*!< Reserved value.                                                      */
    #define BICR_HFXO_CONFIG_MODE_Crystal4 (0x4UL)     /*!< Reserved value.                                                      */
    #define BICR_HFXO_CONFIG_MODE_Crystal5 (0x5UL)     /*!< Reserved value.                                                      */
    #define BICR_HFXO_CONFIG_MODE_Crystal6 (0x6UL)     /*!< Reserved value.                                                      */

    #define DPPIC0_CH_NUM DPPIC0_CH_NUM_SIZE
    #define DPPIC1_CH_NUM DPPIC1_CH_NUM_SIZE

    #define DPPIC0_GROUP_NUM DPPIC0_GROUP_NUM_SIZE
    #define DPPIC1_GROUP_NUM DPPIC1_GROUP_NUM_SIZE

    #define RESETHUB_HAS_NETWORK
    #define RESETHUB_HAS_CELLULAR
    #define RESETHUB_HAS_ISIM

    #define DWT_MISSING
#endif /* defined(NRF9230_ENGB_XXAA) */

/**************************************************************************************************/
/* End fixups section for NRF9230_ENGB_XXAA (HSOC 1.1)                                            */
/**************************************************************************************************/

/**************************************************************************************************/
/* Start fixups section for external                                                              */
/**************************************************************************************************/

#include "soc/nrfx_mdk_fixups_ext.h"

/**************************************************************************************************/
/* End fixups section for external                                                                */
/**************************************************************************************************/

#endif // NRFX_MDK_FIXUPS_H__
